УНФ_ТЕСТ/src/InformationRegisters/ОтслеживаниеИсточниковПривлечения/ОтслеживаниеИсточниковПривлечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтслеживаниеИсточниковПривлечения</name>
  <resources>
    <name>ЗначениеКИДляПоиска</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИсточникПривлечения</name>
    <type>
      <types>CatalogRef.ИсточникиПривлеченияПокупателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКИ</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеКИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/InformationRegisters/ОтслеживаниеИсточниковПривлечения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьИсточникПривлеченияПоКИ(ЗначениеКИ, ЭтоКоллтрекинг = Ложь) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтслеживаниеИсточниковПривлечения.ИсточникПривлечения КАК ИсточникПривлечения
	|ИЗ
	|	РегистрСведений.ОтслеживаниеИсточниковПривлечения КАК ОтслеживаниеИсточниковПривлечения
	|ГДЕ
	|	ОтслеживаниеИсточниковПривлечения.ЗначениеКИ ПОДОБНО &ЗначениеКИ
	|	И НЕ ОтслеживаниеИсточниковПривлечения.ИсточникПривлечения.Недействителен";
	
	Если ЭтоКоллтрекинг Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОтслеживаниеИсточниковПривлечения.ЗначениеКИ", "ОтслеживаниеИсточниковПривлечения.ЗначениеКИДляПоиска");
		ЗначениеКИ = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(ЗначениеКИ);
	КонецЕсли;

	Запрос.УстановитьПараметр("ЗначениеКИ", ЗначениеКИ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ИсточникПривлечения;
	КонецЦикла;
	
	Возврат Справочники.ИсточникиПривлеченияПокупателей.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
